In [1]:
import numpy as np
import pandas as pd

In [2]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [3]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
90 ms ± 354 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
1.22 ms ± 12.2 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [4]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

In [5]:
0 *  np.nan

nan

In [6]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [7]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [8]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [9]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [10]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [11]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [12]:
data = pd.Series([1,2,3, None, 0, None, 'Hello'])

In [13]:
data.isna()

0    False
1    False
2    False
3     True
4    False
5     True
6    False
dtype: bool

In [14]:
data.isnull()

0    False
1    False
2    False
3     True
4    False
5     True
6    False
dtype: bool

In [15]:
data.notna()

0     True
1     True
2     True
3    False
4     True
5    False
6     True
dtype: bool

In [18]:
print(data)
data[data.notnull()]

0        1
1        2
2        3
3     None
4        0
5     None
6    Hello
dtype: object

0        1
1        2
2        3
4        0
6    Hello
dtype: object

In [19]:
data.dropna()

0        1
1        2
2        3
4        0
6    Hello
dtype: object

In [25]:
df = pd.DataFrame([[1, np.nan,'hello'],
                  [4,2, np.nan],
                 ['a',8,0]])
df

   0    1      2
0  1  NaN  hello
1  4  2.0    NaN
2  a  8.0      0

In [26]:
df.dropna()

   0    1  2
2  a  8.0  0

In [27]:
df.dropna(axis='columns')

   0
0  1
1  4
2  a

In [31]:
print(df)
df[3] = np.nan
df

   0    1      2   3
0  1  NaN  hello NaN
1  4  2.0    NaN NaN
2  a  8.0      0 NaN

   0    1      2   3
0  1  NaN  hello NaN
1  4  2.0    NaN NaN
2  a  8.0      0 NaN

In [32]:
df.dropna(axis='columns', how='all')

   0    1      2
0  1  NaN  hello
1  4  2.0    NaN
2  a  8.0      0

In [33]:
df.dropna(axis='rows', thresh=3)

   0    1  2   3
2  a  8.0  0 NaN

In [34]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [35]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [36]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [37]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [38]:
df

   0    1      2   3
0  1  NaN  hello NaN
1  4  2.0    NaN NaN
2  a  8.0      0 NaN

In [39]:
df.fillna(method='ffill', axis=1)

     0    1      2      3
0    1    1  hello  hello
1  4.0  2.0    2.0    2.0
2    a  8.0      0      0